from typing import Any

from src.utils import setup_logging, write_data

logger = setup_logging()


def filter_state(operations: list[dict[Any, Any]]) -> list:
    """функция, которая принимает на вход список транзакций
    и возвращает новый список, содержащий только те словари, у которых ключ содержит переданное в функцию значение."""
    result = []
    for operation in operations:
        if "Переводы" in operation["Категория"]:
            if operation["Описание"].endswith("."):
                result.append(operation)
    logger.info("Результат 'filter_state' - %s" % result)
    write_data("servies.json", result)
    return result


def servies_() -> None:
    translate = filter_state(
        [
            {
                "Дата операции": "16.10.2021 15:16:16",
                "Дата платежа": "16.10.2021",
                "Номер карты": None,
                "Статус": "OK",
                "Сумма операции": -50.0,
                "Валюта операции": "RUB",
                "Сумма платежа": -50.0,
                "Валюта платежа": "RUB",
                "Кэшбэк": None,
                "Категория": "Переводы",
                "MCC": None,
                "Описание": "Азер Г.",
                "Бонусы (включая кэшбэк)": 0,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 50.0,
            },
            {
                "Дата операции": "15.10.2021 21:25:17",
                "Дата платежа": "16.10.2021",
                "Номер карты": "*7197",
                "Статус": "OK",
                "Сумма операции": -86.0,
                "Валюта операции": "RUB",
                "Сумма платежа": -86.0,
                "Валюта платежа": "RUB",
                "Кэшбэк": None,
                "Категория": "Местный транспорт",
                "MCC": 4111.0,
                "Описание": "Северо-Западная пригородная пассажирская компания",
                "Бонусы (включая кэшбэк)": 1,
                "Округление на инвесткопилку": 0,
                "Сумма операции с округлением": 86.0,
            },
        ]
    )
    print(f"\nСервисы: {translate}")